export const test1 = [
  {
    q: "Где правильно указана переменная?",
    o: [`var str = "Hi"`, `int num = "1";`, "done = true;", "char sym = 'a';"],
    a: 3,
  },
  {
    q: "Как подключить стандартную библиотеку iostream?",
    o: [
      "#include iostream",
      `#include <iostream>`,
      "#include “iostream.h”",
      `#include <iostream.h>`,
    ],
    a: 1,
  },
  {
    q:
      "Какое расширение имеет файл исходного кода программы написанное на языке C++ ?",
    o: [".py", ".bas", ".pas", ".cpp"],
    a: 3,
  },
  {
    q:
      "В какой строке приведено название стандартного оператора вывода данных?",
    o: ["cin", "<<", "cout", ">>"],
    a: 2,
  },
  {
    q: "Какое ключевое слово используется для описания константы?",
    o: ["costanta", "CON", "Const", "const"],
    a: 3,
  },
  {
    q: "Как возвести значение переменного x в степень n в С++?",
    o: ["x^n", "pow(x,n)", "pow(n,x)", "exp(x)"],
    a: 1,
  },
  {
    q: "Простые типы данных в С++.",
    o: [
      "целые – int, вещественные – float или double, символьные – string",
      "целые – int, вещественные – float или real, символьные – char",
      "целые – int, вещественные – float или double, символьные – char",
      "целые – bool, вещественные – float или double, символьные – string",
    ],
    a: 2,
  },
  {
    q: "Каким ключевым словом опрeдeляется опeратор условного перехода ?",
    o: ["if", "switch", "for", "goto"],
    a: 0,
  },
  {
    q: `Какой из следующих логических операторов - логический оператор И?`,
    o: ["&&", "|", "&", "||"],
    a: 0,
  },
  {
    q:
      "В каком случае можно не использовать фигурные скобочки в операторе выбора if?",
    o: [
      "если в теле оператора if нет ни одного оператора",
      "нет правильного ответа",
      "если в теле оператора if два и более операторов",
      "если в теле оператора if всего один оператор",
    ],
    a: 3,
  },
];
export const test2 = [
  {
    q: "Olympics?",
    o: ["50 meters", "70 meters", "100 meters", "120 meters"],
    a: 1,
  },
  {
    q: "wheel?",
    o: ["22", "24", "32", "36"],
    a: 3,
  },
  {
    q: "wood?",
    o: ["400 pounds", "550 pounds", "700 pounds", "750 pounds"],
    a: 2,
  },
  {
    q: "sun?",
    o: ["Uranus", "Earth", "Pluto", "Mars"],
    a: 0,
  },
  {
    q: "Earth?",
    o: ["Atlantic Ocean", "Indian Ocean", "Arctic Ocean", "Pacific Ocean"],
    a: 3,
  },
];
