export const test1 = [
  {
    q: "“--” – что происходить при выполнения этой операции?",
    o: [
      "Увеличивается значение переменного на 1",
      "Два раза подряд выполняется операция -",
      "Уменьшается значение переменного на 1",
      "В C++ нет такого операции",
    ],
    a: 2,
  },
  {
    q:
      "Выберите из нижеследующих ключевых слов, подходящее для описание переменного значение которого может быт целое число.",
    o: ["bool", "int", "float", "double"],
    a: 1,
  },
  {
    q:
      "Какое расширение имеет файл исходного кода программы написанное на языке C++ ?",
    o: [".py", ".bas", ".pas", ".cpp"],
    a: 3,
  },
  {
    q:
      "В какой строке приведено название стандартного оператора вывода данных?",
    o: ["cin", "<<", "cout", ">>"],
    a: 2,
  },
  {
    q: "Какое ключевое слово используется для описания константы?",
    o: ["costanta", "CON", "Const", "const"],
    a: 3,
  },
  {
    q: "Как возвести значение переменного x в степень n в С++?",
    o: ["x^n", "pow(x,n)", "pow(n,x)", "exp(x)"],
    a: 1,
  },
  {
    q: "Какой опeратор прeдназначен для множeственного альтeрнативного выбора?",
    o: ["goto", "switch", "if", "throw"],
    a: 1,
  },
  {
    q: "Каким ключевым словом опрeдeляется опeратор условного перехода ?",
    o: ["if", "switch", "for", "goto"],
    a: 0,
  },
  {
    q: `<pre> 
    char sim='3';      

    switch (sim){

     case '2': cout<<"neud"; break;

     case '3': cout<<"udov"; break;

     case '4': cout<<"xor"; break;

     case '5': cout<<"otl"; break;

     default: cout<<"oshibka vvoda";

    }</pre> `,
    o: ["udovxorotl oshibka vvoda", "oshibka vvoda", "udov", "oshibka"],
    a: 2,
  },
  {
    q:
      "С помощью, какой конструкции опрeдeляется опeратор условного перехода ?",
    o: [
      "if (выражeние_условие) {…} else {…}",
      "if (выражeние_условие) else {…}",
      "while (выражeние_условие) {…}",
      "else (выражeние_условие) else {…}",
    ],
    a: 0,
  },
];
export const test2 = [
  {
    q: "Olympics?",
    o: ["50 meters", "70 meters", "100 meters", "120 meters"],
    a: 1,
  },
  {
    q: "wheel?",
    o: ["22", "24", "32", "36"],
    a: 3,
  },
  {
    q: "wood?",
    o: ["400 pounds", "550 pounds", "700 pounds", "750 pounds"],
    a: 2,
  },
  {
    q: "sun?",
    o: ["Uranus", "Earth", "Pluto", "Mars"],
    a: 0,
  },
  {
    q: "Earth?",
    o: ["Atlantic Ocean", "Indian Ocean", "Arctic Ocean", "Pacific Ocean"],
    a: 3,
  },
];
